In [22]:
import pandas as pd
from functions import convert_to_fahrenheit

In [2]:
df_temp = pd.read_csv('Temperature_Data.csv')
df_temp.head()

         Date         City  Temperature_C
0  2023-02-06      Houston          30.11
1  2023-04-04      Houston           6.55
2  2023-01-13      Chicago          25.08
3  2023-04-03      Chicago          24.12
4  2023-01-30  Los Angeles          -6.82

In [7]:
df_temp['IsAbove20'] = df_temp['Temperature_C']> 20

In [8]:
df_temp.head()

         Date         City  Temperature_C  IsAbove20
0  2023-02-06      Houston          30.11       True
1  2023-04-04      Houston           6.55      False
2  2023-01-13      Chicago          25.08       True
3  2023-04-03      Chicago          24.12       True
4  2023-01-30  Los Angeles          -6.82      False

In [20]:
df_temp['Temperature_F'] = df_temp['Temperature_C'].apply(convert_to_fahrenheit)

In [21]:
df_temp.head()

         Date         City  Temperature_C  IsAbove20  Temperature_F
0  2023-02-06      Houston          30.11       True         86.198
1  2023-04-04      Houston           6.55      False         43.790
2  2023-01-13      Chicago          25.08       True         77.144
3  2023-04-03      Chicago          24.12       True         75.416
4  2023-01-30  Los Angeles          -6.82      False         19.724